src/Crysoft/MpesaBundle/Helpers/Soap/status.xml

<?xml version="1.0" encoding="utf-8" ?>
<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
                  xmlns:tns="tns:ns"
                  xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
<soapenv:Header>
    <tns:CheckOutHeader>
        <MERCHANT_ID>CM_PAYBILL</MERCHANT_ID>
        <PASSWORD>CM_PASSWORD</PASSWORD>
        <TIMESTAMP>CM_TIMESTAMP</TIMESTAMP>
    </tns:CheckOutHeader>
</soapenv:Header>
<soapenv:Body>
    <tns:transactionStatusRequest>
        <MERCHANT_TRANSACTION_ID>CM_TRANSACTION_ID</MERCHANT_TRANSACTION_ID>
    </tns:transactionStatusRequest>
</soapenv:Body>
</soapenv:Envelope>